In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(np.random.randn(5,4), ['A','B','C','D','E'], ['W','X','Y','Z'])

In [3]:
df

          W         X         Y         Z
A  0.710379  0.399620  0.236158 -1.098532
B -1.116127 -0.609011 -0.629639 -1.260278
C  2.214904 -0.121102 -0.266826  2.386064
D  0.508682 -0.073277  0.243183 -0.187598
E -0.649942  1.044754 -0.424327  0.343274

CONDITIONAL SELECTION

In [4]:
df > 0 ## THis returns a matrice of booleans of the values that satify the condition

       W      X      Y      Z
A   True   True   True  False
B  False  False  False  False
C   True  False  False   True
D   True  False   True  False
E  False   True  False   True

In [5]:
# In addition, we get the martice of  the values which satisfy the condition
# by seting the condition as a variable and then using df[] 

booldf = df>0

In [6]:
df[booldf]

          W         X         Y         Z
A  0.710379  0.399620  0.236158       NaN
B       NaN       NaN       NaN       NaN
C  2.214904       NaN       NaN  2.386064
D  0.508682       NaN  0.243183       NaN
E       NaN  1.044754       NaN  0.343274

In [7]:
df[df['W']>0] #Here this will return the values of the rows where the value in 'W' is positive,

          W         X         Y         Z
A  0.710379  0.399620  0.236158 -1.098532
C  2.214904 -0.121102 -0.266826  2.386064
D  0.508682 -0.073277  0.243183 -0.187598

In [8]:
## As we can see, the rows B and E were negative in the col 'W' so they have been removed

In [9]:
resultdf = df[df['W']>0]

In [10]:
resultdf

          W         X         Y         Z
A  0.710379  0.399620  0.236158 -1.098532
C  2.214904 -0.121102 -0.266826  2.386064
D  0.508682 -0.073277  0.243183 -0.187598

In [11]:
resultdf['Z']

A   -1.098532
C    2.386064
D   -0.187598
Name: Z, dtype: float64

In [12]:
### We can carry out the last three lines of code in just one line
df[df['W']>0]['Z']

A   -1.098532
C    2.386064
D   -0.187598
Name: Z, dtype: float64

In [13]:
resultdf[['Y', 'Z']]

          Y         Z
A  0.236158 -1.098532
C -0.266826  2.386064
D  0.243183 -0.187598

MULITIPLE CONDITIONS

In [15]:
df[(df['W']>0) & (df['Y']<1)] # We use & as 'and' because if we use 'and' we get an error due to python 
                                ## is comparing booleans not numbers. Recalling from previous lines of code
                                ## we know that the conditions returns a boolean matrice, and then we can apply
                                ## this for searching and then it returns the values matrice

          W         X         Y         Z
A  0.710379  0.399620  0.236158 -1.098532
C  2.214904 -0.121102 -0.266826  2.386064
D  0.508682 -0.073277  0.243183 -0.187598

In [16]:
df[(df['W']>0) | (df['Y']<1)]  # We use | as 'or'

          W         X         Y         Z
A  0.710379  0.399620  0.236158 -1.098532
B -1.116127 -0.609011 -0.629639 -1.260278
C  2.214904 -0.121102 -0.266826  2.386064
D  0.508682 -0.073277  0.243183 -0.187598
E -0.649942  1.044754 -0.424327  0.343274

In [19]:
### we can add a col of index by using the .reset_index(inplace=true). this actually set the index again into a
### numerical value and creates the col index

In [20]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.710379  0.399620  0.236158 -1.098532
1     B -1.116127 -0.609011 -0.629639 -1.260278
2     C  2.214904 -0.121102 -0.266826  2.386064
3     D  0.508682 -0.073277  0.243183 -0.187598
4     E -0.649942  1.044754 -0.424327  0.343274

In [21]:
## We create a new list with .split() that essentially split the spaces between
newind ='CA NY WY OR CO'.split()

In [22]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [23]:
df['States'] = newind

In [24]:
df

          W         X         Y         Z States
A  0.710379  0.399620  0.236158 -1.098532     CA
B -1.116127 -0.609011 -0.629639 -1.260278     NY
C  2.214904 -0.121102 -0.266826  2.386064     WY
D  0.508682 -0.073277  0.243183 -0.187598     OR
E -0.649942  1.044754 -0.424327  0.343274     CO

In [25]:
### we can set this new column as a new col using .set_index('states')

In [28]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.710379  0.399620  0.236158 -1.098532
NY     -1.116127 -0.609011 -0.629639 -1.260278
WY      2.214904 -0.121102 -0.266826  2.386064
OR      0.508682 -0.073277  0.243183 -0.187598
CO     -0.649942  1.044754 -0.424327  0.343274